<!-- TOC -->

- [1. 初衷](#1-初衷)
- [2. _KTRAP_FRAME](#2-_ktrap_frame)
- [3. _CONTEXT](#3-_context)
- [4. _KPCR](#4-_kpcr)
    - [4.1. _NT_TIB](#41-_nt_tib)
    - [4.2. _KPRCB](#42-_kprcb)
- [5. _ETHREAD](#5-_ethread)
    - [5.1. _KTHREAD](#51-_kthread)
        - [5.1.1. _DISPATCHER_HEADER](#511-_dispatcher_header)
        - [5.1.2. _KAPC_STATE](#512-_kapc_state)
        - [5.1.3. _KAPC](#513-_kapc)
        - [5.1.4. _KWAIT_BLOCK](#514-_kwait_block)
- [6. _EPROCESS](#6-_eprocess)
    - [6.1. _KPROCESS](#61-_kprocess)

<!-- /TOC -->
# 1. 初衷
其他笔记中，涉及到内核结构体的时候，都只是记录了其中一部分（完整记录会显得篇幅过长），这就导致查阅起来比较麻烦，这里做一个完整的结构体解释，以便查阅
# 2. _KTRAP_FRAME
```x86asm
kd> dt _kTrap_Frame
nt!_KTRAP_FRAME
   +0x000 DbgEbp           : Uint4B          ; 调试等其他作用
   +0x004 DbgEip           : Uint4B          ;
   +0x008 DbgArgMark       : Uint4B          ;
   +0x00c DbgArgPointer    : Uint4B          ;
   +0x010 TempSegCs        : Uint4B          ;
   +0x014 TempEsp          : Uint4B          ;
   +0x018 Dr0              : Uint4B          ;
   +0x01c Dr1              : Uint4B          ;
   +0x020 Dr2              : Uint4B          ;
   +0x024 Dr3              : Uint4B          ;
   +0x028 Dr6              : Uint4B          ;
   +0x02c Dr7              : Uint4B          ;
   +0x030 SegGs            : Uint4B          ;
   +0x034 SegEs            : Uint4B          ;
   +0x038 SegDs            : Uint4B          ;
   +0x03c Edx              : Uint4B          ;
   +0x040 Ecx              : Uint4B          ;
   +0x044 Eax              : Uint4B          ;
   +0x048 PreviousPreviousMode : Uint4B                             ; Windows中的非易失性寄存器需要在中断例程中先保存
   +0x04c ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD   ;
   +0x050 SegFs            : Uint4B                                 ;
   +0x054 Edi              : Uint4B                                 ;
   +0x058 Esi              : Uint4B                                 ;
   +0x05c Ebx              : Uint4B                                 ;
   +0x060 Ebp              : Uint4B                                 ;
   +0x064 ErrCode          : Uint4B                                 ;
   +0x068 Eip              : Uint4B   ; 中断门时保存代码段和地址，iret返回时用
   +0x06c SegCs            : Uint4B   ;
   +0x070 EFlags           : Uint4B   ;
   +0x074 HardwareEsp      : Uint4B   ; 中断门时若发生权限切换，保存旧堆栈
   +0x078 HardwareSegSs    : Uint4B   ;
   +0x07c V86Es            : Uint4B   ; 虚拟8086模式下保存段寄存器，保护模式下不使用
   +0x080 V86Ds            : Uint4B   ;
   +0x084 V86Fs            : Uint4B   ;
   +0x088 V86Gs            : Uint4B   ;
```
# 3. _CONTEXT
```x86asm
kd> dt _CONTEXT
nt!_CONTEXT
   +0x000 ContextFlags     : Uint4B
   +0x004 Dr0              : Uint4B
   +0x008 Dr1              : Uint4B
   +0x00c Dr2              : Uint4B
   +0x010 Dr3              : Uint4B
   +0x014 Dr6              : Uint4B
   +0x018 Dr7              : Uint4B
   +0x01c FloatSave        : _FLOATING_SAVE_AREA
   +0x08c SegGs            : Uint4B
   +0x090 SegFs            : Uint4B
   +0x094 SegEs            : Uint4B
   +0x098 SegDs            : Uint4B
   +0x09c Edi              : Uint4B
   +0x0a0 Esi              : Uint4B
   +0x0a4 Ebx              : Uint4B
   +0x0a8 Edx              : Uint4B
   +0x0ac Ecx              : Uint4B
   +0x0b0 Eax              : Uint4B
   +0x0b4 Ebp              : Uint4B
   +0x0b8 Eip              : Uint4B
   +0x0bc SegCs            : Uint4B
   +0x0c0 EFlags           : Uint4B
   +0x0c4 Esp              : Uint4B
   +0x0c8 SegSs            : Uint4B
   +0x0cc ExtendedRegisters : [512] UChar
```
# 4. _KPCR
```x86asm
kd> dt _kpcr
nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x01c SelfPcr          : Ptr32 _KPCR         ;指向自身（_KPCR）
   +0x020 Prcb             : Ptr32 _KPRCB        ;指针，指向_KPCR的PrcbData成员，方便日后修改拓展_KPCR结构体
   +0x024 Irql             : UChar
   +0x028 IRR              : Uint4B
   +0x02c IrrActive        : Uint4B
   +0x030 IDR              : Uint4B
   +0x034 KdVersionBlock   : Ptr32 Void
   +0x038 IDT              : Ptr32 _KIDTENTRY    ;IDT表基址，每个CPU都有自己独立的IDT表
   +0x03c GDT              : Ptr32 _KGDTENTRY    ;GDT表基址，每个CPU都有自己独立的GDT表
   +0x040 TSS              : Ptr32 _KTSS         ;TSS任务段基址，每个CPU都有自己独立的TSS任务段
   +0x044 MajorVersion     : Uint2B
   +0x046 MinorVersion     : Uint2B
   +0x048 SetMember        : Uint4B
   +0x04c StallScaleFactor : Uint4B
   +0x050 DebugActive      : UChar
   +0x051 Number           : UChar               ;当前CPU编号
   +0x052 Spare0           : UChar
   +0x053 SecondLevelCacheAssociativity : UChar
   +0x054 VdmAlert         : Uint4B
   +0x058 KernelReserved   : [14] Uint4B
   +0x090 SecondLevelCacheSize : Uint4B
   +0x094 HalReserved      : [16] Uint4B
   +0x0d4 InterruptMode    : Uint4B
   +0x0d8 Spare1           : UChar
   +0x0dc KernelReserved2  : [17] Uint4B
   +0x120 PrcbData         : _KPRCB              ;_KPCR的拓展结构体

```
## 4.1. _NT_TIB
```x86asm
kd> dt _NT_TIB
nt!_NT_TIB
   +0x000 ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD    ;当前线程内核异常链表（SEH）
   +0x004 StackBase        : Ptr32 Void          ;当前线程内核栈基址
   +0x008 StackLimit       : Ptr32 Void          ;当前线程内核栈大小
   +0x00c SubSystemTib     : Ptr32 Void
   +0x010 FiberData        : Ptr32 Void
   +0x010 Version          : Uint4B
   +0x014 ArbitraryUserPointer : Ptr32 Void
   +0x018 Self             : Ptr32 _NT_TIB       ;指向自身（_NT_TIB和_KPCR）
```
## 4.2. _KPRCB
```x86asm
kd> dt _KPRCB
nt!_KPRCB
   +0x000 MinorVersion     : Uint2B
   +0x002 MajorVersion     : Uint2B
   +0x004 CurrentThread    : Ptr32 _KTHREAD      ;CPU当前正在运行的线程
   +0x008 NextThread       : Ptr32 _KTHREAD      ;CPU下一个调度的线程
   +0x00c IdleThread       : Ptr32 _KTHREAD      ;空闲线程，如果没有其它线程可以调度时，CPU需要调度的线程
   +0x010 Number           : Char                ;CPU编号
   +0x011 Reserved         : Char
   +0x012 BuildType        : Uint2B
   +0x014 SetMember        : Uint4B
   +0x018 CpuType          : Char
   +0x019 CpuID            : Char
   +0x01a CpuStep          : Uint2B              ;CPU子版本号
   +0x01c ProcessorState   : _KPROCESSOR_STATE   ;CPU状态
   +0x33c KernelReserved   : [16] Uint4B
   +0x37c HalReserved      : [16] Uint4B
   +0x3bc PrcbPad0         : [92] UChar
   +0x418 LockQueue        : [16] _KSPIN_LOCK_QUEUE
   +0x498 PrcbPad1         : [8] UChar
   +0x4a0 NpxThread        : Ptr32 _KTHREAD      ;NPX浮点寄存器，最后一次用过NPX浮点寄存器的线程
   +0x4a4 InterruptCount   : Uint4B              ;中断次数
   +0x4a8 KernelTime       : Uint4B              ;统计信息
   +0x4ac UserTime         : Uint4B              ;统计信息
   +0x4b0 DpcTime          : Uint4B
   +0x4b4 DebugDpcTime     : Uint4B
   +0x4b8 InterruptTime    : Uint4B
   +0x4bc AdjustDpcThreshold : Uint4B
   +0x4c0 PageColor        : Uint4B
   +0x4c4 SkipTick         : Uint4B
   +0x4c8 MultiThreadSetBusy : UChar
   +0x4c9 Spare2           : [3] UChar
   +0x4cc ParentNode       : Ptr32 _KNODE
   +0x4d0 MultiThreadProcessorSet : Uint4B
   +0x4d4 MultiThreadSetMaster : Ptr32 _KPRCB
   +0x4d8 ThreadStartCount : [2] Uint4B
   +0x4e0 CcFastReadNoWait : Uint4B
   +0x4e4 CcFastReadWait   : Uint4B
   +0x4e8 CcFastReadNotPossible : Uint4B
   +0x4ec CcCopyReadNoWait : Uint4B
   +0x4f0 CcCopyReadWait   : Uint4B
   +0x4f4 CcCopyReadNoWaitMiss : Uint4B
   +0x4f8 KeAlignmentFixupCount : Uint4B
   +0x4fc KeContextSwitches : Uint4B
   +0x500 KeDcacheFlushCount : Uint4B
   +0x504 KeExceptionDispatchCount : Uint4B
   +0x508 KeFirstLevelTbFills : Uint4B
   +0x50c KeFloatingEmulationCount : Uint4B
   +0x510 KeIcacheFlushCount : Uint4B
   +0x514 KeSecondLevelTbFills : Uint4B
   +0x518 KeSystemCalls    : Uint4B
   +0x51c SpareCounter0    : [1] Uint4B
   +0x520 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
   +0x5a0 PPNPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x6a0 PPPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x7a0 PacketBarrier    : Uint4B
   +0x7a4 ReverseStall     : Uint4B
   +0x7a8 IpiFrame         : Ptr32 Void
   +0x7ac PrcbPad2         : [52] UChar
   +0x7e0 CurrentPacket    : [3] Ptr32 Void
   +0x7ec TargetSet        : Uint4B
   +0x7f0 WorkerRoutine    : Ptr32     void 
   +0x7f4 IpiFrozen        : Uint4B
   +0x7f8 PrcbPad3         : [40] UChar
   +0x820 RequestSummary   : Uint4B
   +0x824 SignalDone       : Ptr32 _KPRCB
   +0x828 PrcbPad4         : [56] UChar
   +0x860 DpcListHead      : _LIST_ENTRY
   +0x868 DpcStack         : Ptr32 Void
   +0x86c DpcCount         : Uint4B
   +0x870 DpcQueueDepth    : Uint4B
   +0x874 DpcRoutineActive : Uint4B
   +0x878 DpcInterruptRequested : Uint4B
   +0x87c DpcLastCount     : Uint4B
   +0x880 DpcRequestRate   : Uint4B
   +0x884 MaximumDpcQueueDepth : Uint4B
   +0x888 MinimumDpcRate   : Uint4B
   +0x88c QuantumEnd       : Uint4B              ;标志当前线程的CPU时间片是否用完，没用完的时候是0，用完的时候是非0值
   +0x890 PrcbPad5         : [16] UChar
   +0x8a0 DpcLock          : Uint4B
   +0x8a4 PrcbPad6         : [28] UChar
   +0x8c0 CallDpc          : _KDPC
   +0x8e0 ChainedInterruptList : Ptr32 Void
   +0x8e4 LookasideIrpFloat : Int4B
   +0x8e8 SpareFields0     : [6] Uint4B
   +0x900 VendorString     : [13] UChar
   +0x90d InitialApicId    : UChar
   +0x90e LogicalProcessorsPerPhysicalProcessor : UChar
   +0x910 MHz              : Uint4B              ;频率
   +0x914 FeatureBits      : Uint4B
   +0x918 UpdateSignature  : _LARGE_INTEGER
   +0x920 NpxSaveArea      : _FX_SAVE_AREA
   +0xb30 PowerState       : _PROCESSOR_POWER_STATE
```
# 5. _ETHREAD
```x86asm
kd> dt _ETHREAD
nt!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x1c0 CreateTime       : _LARGE_INTEGER
   +0x1c0 NestedFaultCount : Pos 0, 2 Bits
   +0x1c0 ApcNeeded        : Pos 2, 1 Bit
   +0x1c8 ExitTime         : _LARGE_INTEGER
   +0x1c8 LpcReplyChain    : _LIST_ENTRY
   +0x1c8 KeyedWaitChain   : _LIST_ENTRY
   +0x1d0 ExitStatus       : Int4B
   +0x1d0 OfsChain         : Ptr32 Void
   +0x1d4 PostBlockList    : _LIST_ENTRY
   +0x1dc TerminationPort  : Ptr32 _TERMINATION_PORT
   +0x1dc ReaperLink       : Ptr32 _ETHREAD
   +0x1dc KeyedWaitValue   : Ptr32 Void
   +0x1e0 ActiveTimerListLock : Uint4B
   +0x1e4 ActiveTimerListHead : _LIST_ENTRY
   +0x1ec Cid              : _CLIENT_ID          ;进程ID和线程ID
   +0x1f4 LpcReplySemaphore : _KSEMAPHORE
   +0x1f4 KeyedWaitSemaphore : _KSEMAPHORE
   +0x208 LpcReplyMessage  : Ptr32 Void
   +0x208 LpcWaitingOnPort : Ptr32 Void
   +0x20c ImpersonationInfo : Ptr32 _PS_IMPERSONATION_INFORMATION
   +0x210 IrpList          : _LIST_ENTRY
   +0x218 TopLevelIrp      : Uint4B
   +0x21c DeviceToVerify   : Ptr32 _DEVICE_OBJECT
   +0x220 ThreadsProcess   : Ptr32 _EPROCESS     ;当前进程结构体的指针，可以定位进程
   +0x224 StartAddress     : Ptr32 Void
   +0x228 Win32StartAddress : Ptr32 Void
   +0x228 LpcReceivedMessageId : Uint4B
   +0x22c ThreadListEntry  : _LIST_ENTRY         ;连接一个进程所有线程的双向链表，总共存在两个这样的链表
   +0x234 RundownProtect   : _EX_RUNDOWN_REF
   +0x238 ThreadLock       : _EX_PUSH_LOCK
   +0x23c LpcReplyMessageId : Uint4B
   +0x240 ReadClusterSize  : Uint4B
   +0x244 GrantedAccess    : Uint4B
   +0x248 CrossThreadFlags : Uint4B
   +0x248 Terminated       : Pos 0, 1 Bit
   +0x248 DeadThread       : Pos 1, 1 Bit
   +0x248 HideFromDebugger : Pos 2, 1 Bit
   +0x248 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x248 SystemThread     : Pos 4, 1 Bit
   +0x248 HardErrorsAreDisabled : Pos 5, 1 Bit
   +0x248 BreakOnTermination : Pos 6, 1 Bit
   +0x248 SkipCreationMsg  : Pos 7, 1 Bit
   +0x248 SkipTerminationMsg : Pos 8, 1 Bit
   +0x24c SameThreadPassiveFlags : Uint4B
   +0x24c ActiveExWorker   : Pos 0, 1 Bit
   +0x24c ExWorkerCanWaitUser : Pos 1, 1 Bit
   +0x24c MemoryMaker      : Pos 2, 1 Bit
   +0x250 SameThreadApcFlags : Uint4B
   +0x250 LpcReceivedMsgIdValid : Pos 0, 1 Bit
   +0x250 LpcExitThreadCalled : Pos 1, 1 Bit
   +0x250 AddressSpaceOwner : Pos 2, 1 Bit
   +0x254 ForwardClusterOnly : UChar
   +0x255 DisablePageFaultClustering : UChar
```
## 5.1. _KTHREAD
```x86asm
kd> dt _kthread
nt!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER  ;标识_KTHREAD即线程为可等待对象
   +0x010 MutantListHead   : _LIST_ENTRY
   +0x018 InitialStack     : Ptr32 Void          ;线程切换相关
   +0x01c StackLimit       : Ptr32 Void          ;线程切换相关
   +0x020 Teb              : Ptr32 Void          ;Thread Environment Block，线程环境块，大小4KB，线程在3环的一个结构体（3环进程可以对其进行读写），里面包含了线程的重要信息，在三环时fs:[0] -> teb，在0环时fs:[0] -> _kpcr
   +0x024 TlsArray         : Ptr32 Void
   +0x028 KernelStack      : Ptr32 Void          ;线程切换时存储栈顶指针
   +0x02c DebugActive      : UChar               ;调试相关，该值为-1的话不能使用调试寄存器Dr0-Dr7，3环进入0环时不会填充_kTrap_Frame中调试相关成员的值
   +0x02d State            : UChar               ;线程状态：就绪、等待、运行，仅仅用作记录，和线程的调度无关，1-就绪，2-运行，5-等待
   +0x02e Alerted          : [2] UChar
   +0x030 Iopl             : UChar
   +0x031 NpxState         : UChar
   +0x032 Saturation       : Char
   +0x033 Priority         : Char
   +0x034 ApcState         : _KAPC_STATE         ;APC队列
   +0x04c ContextSwitches  : Uint4B
   +0x050 IdleSwapBlock    : UChar
   +0x051 Spare0           : [3] UChar
   +0x054 WaitStatus       : Int4B
   +0x058 WaitIrql         : UChar
   +0x059 WaitMode         : Char
   +0x05a WaitNext         : UChar
   +0x05b WaitReason       : UChar
   +0x05c WaitBlockList    : Ptr32 _KWAIT_BLOCK  ;等待块列表，同步机制中线程等待与唤醒相关
   +0x060 WaitListEntry    : _LIST_ENTRY         ;线程所属等待链表，线程调度相关
   +0x060 SwapListEntry    : _SINGLE_LIST_ENTRY  ;线程所属调度链表，线程调度相关，和线程所属等待链表占据同一个位置，也就是说线程只能同时属于其中一个链表
   +0x068 WaitTime         : Uint4B
   +0x06c BasePriority     : Char                ;基础优先级，从所属进程继承而来（KPROCESS->BasePriority），但是可以通过KeSetBasePriorityThread函数重新设置
   +0x06d DecrementCount   : UChar
   +0x06e PriorityDecrement : Char
   +0x06f Quantum          : Char                ;调度相关，CPU时间片
   +0x070 WaitBlock        : [4] _KWAIT_BLOCK    ;指示线程等待的是哪个对象
   +0x0d0 LegoData         : Ptr32 Void
   +0x0d4 KernelApcDisable : Uint4B              ;判断当前线程是否禁用内核APC，1代表禁用
   +0x0d8 UserAffinity     : Uint4B
   +0x0dc SystemAffinityActive : UChar
   +0x0dd PowerState       : UChar
   +0x0de NpxIrql          : UChar
   +0x0df InitialNode      : UChar
   +0x0e0 ServiceTable     : Ptr32 Void          ;系统服务表基址
   +0x0e4 Queue            : Ptr32 _KQUEUE
   +0x0e8 ApcQueueLock     : Uint4B              ;APC相关
   +0x0f0 Timer            : _KTIMER
   +0x118 QueueListEntry   : _LIST_ENTRY
   +0x120 SoftAffinity     : Uint4B
   +0x124 Affinity         : Uint4B
   +0x128 Preempted        : UChar
   +0x129 ProcessReadyQueue : UChar
   +0x12a KernelStackResident : UChar
   +0x12b NextProcessor    : UChar
   +0x12c CallbackStack    : Ptr32 Void
   +0x130 Win32Thread      : Ptr32 Void
   +0x134 TrapFrame        : Ptr32 _KTRAP_FRAME  ;用于进0环时保存环境
   +0x138 ApcStatePointer  : [2] Ptr32 _KAPC_STATE    ;正常情况下，ApcStatePointer[0]指向ApcState，ApcStatePointer[1]指向SavedApcState，线程挂靠情况下，指针指向相反
   +0x140 PreviousMode     : Char                ;先前模式，用于某些内核函数判断程序是0环调用的还是3环调用的
   +0x141 EnableStackSwap  : UChar
   +0x142 LargeStack       : UChar
   +0x143 ResourceIndex    : UChar
   +0x144 KernelTime       : Uint4B
   +0x148 UserTime         : Uint4B
   +0x14c SavedApcState    : _KAPC_STATE         ;备用APC队列
   +0x164 Alertable        : UChar               ;标识当前线程在等待时是否可以被APC唤醒，0代表不可以，1代表可以；SleepEx和WaitForSingleObjectEx函数可以通过最后一个参数显示指定该值（该参数为True代表可以被唤醒，False代表不可以）
   +0x165 ApcStateIndex    : UChar               ;标识当前线程处于什么状态，0表示正常状态，1表示挂靠状态
   +0x166 ApcQueueable     : UChar               ;表示是否可以向线程的APC队列中插入APC，当线程正在执行退出的代码时，会将这个值设置为0，如果此时执行插入APC的代码（KeInsertQueueApc），在插入函数中会判断这个值是否为0，如果是则插入失败
   +0x167 AutoAlignment    : UChar
   +0x168 StackBase        : Ptr32 Void
   +0x16c SuspendApc       : _KAPC
   +0x19c SuspendSemaphore : _KSEMAPHORE
   +0x1b0 ThreadListEntry  : _LIST_ENTRY         ;连接一个进程所有线程的双向链表，总共存在两个这样的链表
   +0x1b8 FreezeCount      : Char
   +0x1b9 SuspendCount     : Char
   +0x1ba IdealProcessor   : UChar
   +0x1bb DisableBoost     : UChar
```
### 5.1.1. _DISPATCHER_HEADER
```
x86asm
kd> dt _DISPATCHER_HEADER
nt!_DISPATCHER_HEADER
   +0x000 Type             : UChar
   +0x001 Absolute         : UChar
   +0x002 Size             : UChar
   +0x003 Inserted         : UChar
   +0x004 SignalState      : Int4B
   +0x008 WaitListHead     : _LIST_ENTRY        ;链表头，指向等待块列表，这是一个双向循环链表，链接了所有等待该可等待对象的线程的等待块
```
### 5.1.2. _KAPC_STATE
```x86asm
kd> dt _KAPC_STATE
nt!_KAPC_STATE
    +0x000 ApcListHead      : [2] _LIST_ENTRY   ;APC队列，两个双向链表，里面存储了线程需要执行的APC函数。第一个是内核APC链表（函数为内核空间函数），第二个是用户APC链表（函数为用户空间函数）
    +0x010 Process          : Ptr32 _KPROCESS   ;指向为线程提供CR3的进程
    +0x014 KernelApcInProgress : UChar          ;指示内核APC函数是否正在执行，1代表正在执行
    +0x015 KernelApcPending : UChar             ;是否存在内核APC函数，存在则置1，不存在置0
    +0x016 UserApcPending   : UChar             ;是否存在用户APC函数，存在则置1，不存在置0
```
### 5.1.3. _KAPC
```x86asm
kd> dt _KAPC
nt!_KAPC
    +0x000 Type             : Int2B           ;Windows内核对象（进程、线程、事件等）类型，APC为0x12
    +0x002 Size             : Int2B           ;本结构体大小，0x30
    +0x004 Spare0           : Uint4B          ;无意义，用于内存对齐
    +0x008 Thread           : Ptr32 _KTHREAD  ;目标线程
    +0x00c ApcListEntry     : _LIST_ENTRY     ;APC队列所挂位置
    +0x014 KernelRoutine    : Ptr32     void  ;指向一个函数，APC函数执行完毕之后Windows会调用这个函数，该函数需调用ExFreePoolWithTag来销毁KAPC结构体 
    +0x018 RundownRoutine   : Ptr32     void  ;未使用
    +0x01c NormalRoutine    : Ptr32     void  ;用户APC：用户APC总入口；内核APC：函数地址
    +0x020 NormalContext    : Ptr32 Void      ;内核APC：NULL；用户APC：函数地址
    +0x024 SystemArgument1  : Ptr32 Void      ;APC参数1
    +0x028 SystemArgument2  : Ptr32 Void      ;APC参数2
    +0x02c ApcStateIndex    : Char            ;标识希望APC挂在哪个队列
    +0x02d ApcMode          : Char            ;0代表内核APC，1代表用户APC
    +0x02e Inserted         : UChar           ;标识当前APC是否已经插入队列，是为1，否为0
```
### 5.1.4. _KWAIT_BLOCK
```
kd> dt _KWAIT_BLOCK
nt!_KWAIT_BLOCK
   +0x000 WaitListEntry    : _LIST_ENTRY            ;连接一个被等待对象的所有等待块的双向链表
   +0x008 Thread           : Ptr32 _KTHREAD         ;等待块对应线程
   +0x00c Object           : Ptr32 Void             ;被等待对象的地址
   +0x010 NextWaitBlock    : Ptr32 _KWAIT_BLOCK     ;连接一个线程的所有等待块的单向循环链表中的下一跳指针
   +0x014 WaitKey          : Uint2B                 ;线程的等待块的索引
   +0x016 WaitType         : Uint2B                 ;等待类型，0代表需要所有被等待对象都符合条件才能激活，1代表只需要一个被等待对象符合条件就可以激活

```
# 6. _EPROCESS
```x86asm
kd> dt _EPROCESS
nt!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x06c ProcessLock      : _EX_PUSH_LOCK       ;控制结构体只允许一个人改
   +0x070 CreateTime       : _LARGE_INTEGER      ;进程的创建时间
   +0x078 ExitTime         : _LARGE_INTEGER      ;进程的退出时间
   +0x080 RundownProtect   : _EX_RUNDOWN_REF     ;锁定链表用
   +0x084 UniqueProcessId  : Ptr32 Void          ;进程ID
   +0x088 ActiveProcessLinks : _LIST_ENTRY       ;连接所有活动进程的双向链表，全局变量PsActiveProcessHead指向链表头。利用PsActiveProcessHead加上该成员可以遍历所有进程，通过断链可以使得可以从WindowsAPI中隐藏进程，但是进程仍然可以正常运行（Windows的调度单元是线程，进程仅仅提供了一个运行环境如资源和物理页基址）
   +0x090 QuotaUsage       : [3] Uint4B          ;物理页相关统计信息
   +0x09c QuotaPeak        : [3] Uint4B          ;物理页相关统计信息
   +0x0a8 CommitCharge     : Uint4B              ;物理页相关
   +0x0ac PeakVirtualSize  : Uint4B              ;虚拟内存峰值（虚拟内存就是用磁盘充当内存）
   +0x0b0 VirtualSize      : Uint4B              ;虚拟内存大小
   +0x0b4 SessionProcessLinks : _LIST_ENTRY      
   +0x0bc DebugPort        : Ptr32 Void          ;调试端口（INT 01和INT 03，消息发到调试端口，这两种异常调试器一般要单独处理），该值为0的情况下无法通过正常手段来调试进程（可以通过其它手段）
   +0x0c0 ExceptionPort    : Ptr32 Void          ;异常端口（其它异常，消息先发到调试器，然后发到异常端口），调试相关
   +0x0c4 ObjectTable      : Ptr32 _HANDLE_TABLE ;对象句柄表，存有进程使用的各种其它内核的对象（事件、互斥体、文件等）的句柄（即地址）
   +0x0c8 Token            : _EX_FAST_REF
   +0x0cc WorkingSetLock   : _FAST_MUTEX
   +0x0ec WorkingSetPage   : Uint4B
   +0x0f0 AddressCreationLock : _FAST_MUTEX
   +0x110 HyperSpaceLock   : Uint4B
   +0x114 ForkInProgress   : Ptr32 _ETHREAD
   +0x118 HardwareTrigger  : Uint4B
   +0x11c VadRoot          : Ptr32 Void          ;标识用户地址空间0-2G使用情况（虚拟地址描述符）
   +0x120 VadHint          : Ptr32 Void
   +0x124 CloneRoot        : Ptr32 Void
   +0x128 NumberOfPrivatePages : Uint4B
   +0x12c NumberOfLockedPages : Uint4B
   +0x130 Win32Process     : Ptr32 Void
   +0x134 Job              : Ptr32 _EJOB
   +0x138 SectionObject    : Ptr32 Void
   +0x13c SectionBaseAddress : Ptr32 Void
   +0x140 QuotaBlock       : Ptr32 _EPROCESS_QUOTA_BLOCK
   +0x144 WorkingSetWatch  : Ptr32 _PAGEFAULT_HISTORY
   +0x148 Win32WindowStation : Ptr32 Void
   +0x14c InheritedFromUniqueProcessId : Ptr32 Void
   +0x150 LdtInformation   : Ptr32 Void
   +0x154 VadFreeHint      : Ptr32 Void
   +0x158 VdmObjects       : Ptr32 Void
   +0x15c DeviceMap        : Ptr32 Void
   +0x160 PhysicalVadList  : _LIST_ENTRY
   +0x168 PageDirectoryPte : _HARDWARE_PTE
   +0x168 Filler           : Uint8B
   +0x170 Session          : Ptr32 Void
   +0x174 ImageFileName    : [16] UChar          ;进程镜像文件名，最多显示16个字节，多余字节将被截断
   +0x184 JobLinks         : _LIST_ENTRY
   +0x18c LockedPagesList  : Ptr32 Void
   +0x190 ThreadListHead   : _LIST_ENTRY         ;连接该进程所有线程的双向链表（总共存在两个这样的链表）的头，示意图见2.1节
   +0x198 SecurityPort     : Ptr32 Void
   +0x19c PaeTop           : Ptr32 Void
   +0x1a0 ActiveThreads    : Uint4B              ;活动线程的数量，0代表无活动线程，进程即将结束，将会从活动进程链表中被移除
   +0x1a4 GrantedAccess    : Uint4B
   +0x1a8 DefaultHardErrorProcessing : Uint4B
   +0x1ac LastThreadExitStatus : Int4B
   +0x1b0 Peb              : Ptr32 _PEB          ;Process Environment Block，进程环境块，进程在3环的一个结构体（3环进程可以对其进行读写），里面包含了进程的模块列表、是否处于调试状态等重要信息
   +0x1b4 PrefetchTrace    : _EX_FAST_REF
   +0x1b8 ReadOperationCount : _LARGE_INTEGER
   +0x1c0 WriteOperationCount : _LARGE_INTEGER
   +0x1c8 OtherOperationCount : _LARGE_INTEGER
   +0x1d0 ReadTransferCount : _LARGE_INTEGER
   +0x1d8 WriteTransferCount : _LARGE_INTEGER
   +0x1e0 OtherTransferCount : _LARGE_INTEGER
   +0x1e8 CommitChargeLimit : Uint4B
   +0x1ec CommitChargePeak : Uint4B
   +0x1f0 AweInfo          : Ptr32 Void
   +0x1f4 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
   +0x1f8 Vm               : _MMSUPPORT
   +0x238 LastFaultCount   : Uint4B
   +0x23c ModifiedPageCount : Uint4B
   +0x240 NumberOfVads     : Uint4B
   +0x244 JobStatus        : Uint4B
   +0x248 Flags            : Uint4B
   +0x248 CreateReported   : Pos 0, 1 Bit
   +0x248 NoDebugInherit   : Pos 1, 1 Bit
   +0x248 ProcessExiting   : Pos 2, 1 Bit
   +0x248 ProcessDelete    : Pos 3, 1 Bit
   +0x248 Wow64SplitPages  : Pos 4, 1 Bit
   +0x248 VmDeleted        : Pos 5, 1 Bit
   +0x248 OutswapEnabled   : Pos 6, 1 Bit
   +0x248 Outswapped       : Pos 7, 1 Bit
   +0x248 ForkFailed       : Pos 8, 1 Bit
   +0x248 HasPhysicalVad   : Pos 9, 1 Bit
   +0x248 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x248 SetTimerResolution : Pos 12, 1 Bit
   +0x248 BreakOnTermination : Pos 13, 1 Bit
   +0x248 SessionCreationUnderway : Pos 14, 1 Bit
   +0x248 WriteWatch       : Pos 15, 1 Bit
   +0x248 ProcessInSession : Pos 16, 1 Bit
   +0x248 OverrideAddressSpace : Pos 17, 1 Bit
   +0x248 HasAddressSpace  : Pos 18, 1 Bit
   +0x248 LaunchPrefetched : Pos 19, 1 Bit
   +0x248 InjectInpageErrors : Pos 20, 1 Bit
   +0x248 VmTopDown        : Pos 21, 1 Bit
   +0x248 Unused3          : Pos 22, 1 Bit
   +0x248 Unused4          : Pos 23, 1 Bit
   +0x248 VdmAllowed       : Pos 24, 1 Bit
   +0x248 Unused           : Pos 25, 5 Bits
   +0x248 Unused1          : Pos 30, 1 Bit
   +0x248 Unused2          : Pos 31, 1 Bit
   +0x24c ExitStatus       : Int4B
   +0x250 NextPageColor    : Uint2B
   +0x252 SubSystemMinorVersion : UChar
   +0x253 SubSystemMajorVersion : UChar
   +0x252 SubSystemVersion : Uint2B
   +0x254 PriorityClass    : UChar
   +0x255 WorkingSetAcquiredUnsafe : UChar
   +0x258 Cookie           : Uint4B
```
## 6.1. _KPROCESS
````x86asm
kd> dt _KPROCESS
nt!_KPROCESS
   +0x000 Header           : _DISPATCHER_HEADER    ;标识_KPROCESS即进程为可等待对象（即可被WaitForSingleObject等函数等待的对象，如Mutex互斥体、Event事件等），所有可等待对象的第一个成员均为_DISPATCHER_HEADER结构体
   +0x010 ProfileListHead  : _LIST_ENTRY
   +0x018 DirectoryTableBase : [2] Uint4B          ;页目录表的基址
   +0x020 LdtDescriptor    : _KGDTENTRY            ;历史遗留问题，16位Windows段选择子不够，所以每个进程都有一个LDT表；32位Windows下该成员无意义
   +0x028 Int21Descriptor  : _KIDTENTRY            ;DOS下使用
   +0x030 IopmOffset       : Uint2B
   +0x032 Iopl             : UChar
   +0x033 Unused           : UChar
   +0x034 ActiveProcessors : Uint4B
   +0x038 KernelTime       : Uint4B                ;统计信息，统计进程在内核模式下所花的时间
   +0x03c UserTime         : Uint4B                ;统计信息，统计进程在用户模式下所花的时间
   +0x040 ReadyListHead    : _LIST_ENTRY
   +0x048 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x04c VdmTrapcHandler  : Ptr32 Void
   +0x050 ThreadListHead   : _LIST_ENTRY           ;连接该进程所有线程的双向链表（总共存在两个这样的链表）的头
   +0x058 ProcessLock      : Uint4B
   +0x05c Affinity         : Uint4B                ;规定进程里面的所有线程能够在哪个CPU上运行，比特位为1的下标号对应的CPU可以运行，比如4（100）代表可以在2号CPU上运行，如果此时只有一个或者两个CPU，该进程将会结束。所以32位最多32核，64位最多64核
   +0x060 StackCount       : Uint2B
   +0x062 BasePriority     : Char                  ;基础优先级，该进程中所有线程最起码的优先级（即所有线程的优先级均会大于等于此优先级）
   +0x063 ThreadQuantum    : Char                  ;调度相关，线程CPU时间片基础值
   +0x064 AutoAlignment    : UChar
   +0x065 State            : UChar
   +0x066 ThreadSeed       : UChar
   +0x067 DisableBoost     : UChar
   +0x068 PowerState       : UChar
   +0x069 DisableQuantum   : UChar
   +0x06a IdealNode        : UChar
   +0x06b Flags            : _KEXECUTE_OPTIONS
   +0x06b ExecuteOptions   : UChar
```